src/toir_cfe/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b863b14e-c352-4234-8c63-d86d97f12044">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6a750754-4a73-402d-8f35-6a379ec1cb60">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="23087b8e-d21e-4499-beac-8287045096a2">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="35c6e5ea-774c-4081-b20e-6b7733152e33">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f458fa39-e462-44c2-a688-fb165a2c6c8d">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="41c9c7b6-5db5-492f-8a78-0e1fb54a88c4">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/AccumulationRegisters/торо_ФактическиеМатериальныеЗатратыРемонтныхРабот/торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="730c0649-a083-41c6-b68d-f4a04ba5a938">
  <name>торо_ФактическиеМатериальныеЗатратыРемонтныхРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources extendedConfigurationObject="f6e67454-4142-4bb0-ad36-92ef837e3590">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="b32f3f8e-524d-42bc-bc9e-6142ab3e194b">
    <name>РемонтыОборудования_ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="3ad54aac-2804-4a4c-9650-cd312ca0b43c">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f49f6787-f70a-4b47-91b6-46f78e005928">
    <name>ХарактеристикаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/AccumulationRegisters/проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт/проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6ae04480-96d0-4b42-a38a-77468b8202a6">
  <name>проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="08ca1fe2-22ec-4b93-a944-e923fd69ea51">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="b0a906f0-c1ef-48b1-9e3c-1419f3d9e085">
    <name>АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cf269c73-3461-41b0-b4ca-c1d0165d64a0">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="94b5fc89-114f-4c0b-bbfc-774d7d18f1fb">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/InformationRegisters/торо_ИнтеграцияДокументов/торо_ИнтеграцияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17a02a98-8e64-4576-9b3b-4cfc58e2d8cf">
  <name>торо_ИнтеграцияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="e9a88077-61c6-452d-90f2-47d4f24e77da">
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="4736aca1-8591-4fd1-81ac-2e197db4fc05">
    <name>ДокументТОИР</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e9f3faae-f405-4f24-9277-030e531fcfbb">
    <name>ДокументЕРП</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Documents/торо_ЗаявкаНаРемонт/торо_ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="145aacdb-f868-47fa-a11a-64c1ee401e0c">
  <name>торо_ЗаявкаНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0897f476-6166-46f5-b06b-269173e4520e">
    <name>проф_СтатусСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="03e32b56-c47c-4bc5-93ac-0da2e38d3c38">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8e0e-2544-4812-8554-4a3ee2dc14b2">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ed39b61-bbcb-4d6e-853d-79611e8e5aff">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f6af02a-4b40-4613-8cc7-8b4a64e0e244">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ccc4499d-64f9-48a4-98c6-612249fc206f">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="45912545-c381-435b-9239-8860ec2db3af">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/торо_НарядНаВыполнениеРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="91a3657a-5af9-486c-bdd1-67ccd3de7fce">
  <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="f70fd13e-81a3-43b3-9a2a-08cc80f978c7">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5e090819-3bf8-4a64-a7d2-0ab585ce4316">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_ПланГрафикРемонта/торо_ПланГрафикРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="71909b36-38e5-4d41-9803-7860ed2b377d">
  <name>торо_ПланГрафикРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="7e9515d4-1e0b-402a-8a9b-c6a04c349bc7">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="caabbdda-e895-4d1f-939f-3da6bbc4ef8a">
    <name>ПланРемонтов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="33a739f5-f146-4490-87df-57785546d548">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_СостоянияОбъектовРемонта/торо_СостоянияОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="23cdc2e0-c8fb-411b-a976-ed6952618937">
  <name>торо_СостоянияОбъектовРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ce46f3b3-678d-45c3-834d-506cd592653f">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f68ead0e-ff44-4a11-ba24-e2f89589947b">
    <name>ОбъектыРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0281d76f-6aa0-4fff-ab25-5a81258abfb3">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="41f4f6c1-a9c4-443f-97b5-62a83d5a9725">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="feae67ed-6dc9-49c5-a307-3811be01be0e">
    <name>проф_ЗаказДляЗакупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3130c2d1-275a-4006-8bec-ffc8eadaf912">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aaee8848-18c0-4459-8461-a6f8cde70246">
    <name>торо_СозданПоПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="873a5588-15b7-419a-ac32-2cfcdd64f86d">
    <name>проф_ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c7396b0-71b0-4c54-b9bf-4c429c4af1f6">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a9600285-8615-4521-86d8-2bca0bfd8ec8">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3a3c3667-121d-46f4-9b5f-3490c0bc2096">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff47e900-26d4-480f-862d-e7a594cde170">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd34090-ac80-44d9-b29a-f37fc28b0c69">
    <name>торо_СтатусУтверждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0c65fe73-4b60-4819-b7d6-6271b93f49c0">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f24b0b4d-40fc-46e5-9a5c-1c14fd1080ca">
    <name>проф_ТоварыИсточника</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_АктОВыполненииЭтапаРабот/ObjectModule.bsl
#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура проф_ОбработкаПроведения(Отказ, РежимПроведения)

	ШаблонСообщения = НСтр("ru = 'Есть непроведенный документ основание: %1'");
	МассивДокументовОснований = ОбщегоНазначения.ВыгрузитьКолонку(ДокументыОснования,"ДокументОснование");
	Запрос = Новый Запрос(	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВнешнееОснованиеДляРабот.Ссылка КАК Ссылка,
	|	торо_ВнешнееОснованиеДляРабот.Проведен КАК Проведен
	|ИЗ
	|	Документ.торо_ВнешнееОснованиеДляРабот КАК торо_ВнешнееОснованиеДляРабот
	|ГДЕ
	|	торо_ВнешнееОснованиеДляРабот.Ссылка В(&МассивДокОсн)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефекты.Ссылка,
	|	торо_ВыявленныеДефекты.Проведен
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|ГДЕ
	|	торо_ВыявленныеДефекты.Ссылка В(&МассивДокОсн)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонт.Ссылка,
	|	торо_ЗаявкаНаРемонт.Проведен
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	|ГДЕ
	|	торо_ЗаявкаНаРемонт.Ссылка В(&МассивДокОсн)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_НарядНаВыполнениеРемонтныхРабот.Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРабот.Проведен
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот КАК торо_НарядНаВыполнениеРемонтныхРабот
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРабот.Ссылка В(&МассивДокОсн)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПланГрафикРемонта.Ссылка,
	|	торо_ПланГрафикРемонта.Проведен
	|ИЗ
	|	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	|ГДЕ
	|	торо_ПланГрафикРемонта.Ссылка В(&МассивДокОсн)");

	Запрос.УстановитьПараметр("МассивДокОсн", МассивДокументовОснований);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Не Выборка.Проведен Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(Выборка.Ссылка));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;

	ПроверитьЗавершенностьОстановочных(Отказ);

	ПроверитьДатуДокумента(Отказ);

	РемонтыОборудованияТаблицаЗначений = РемонтыОборудования.Выгрузить(); 
	РемонтыОтсутствующиеВДокументахИсточниках = торо_Ремонты.ПроверитьНаличиеРемонтовВДокументахИсточникахПоIDРемонта(РемонтыОборудованияТаблицаЗначений);

	Если НЕ РемонтыОтсутствующиеВДокументахИсточниках = Неопределено Тогда

		Для каждого Ремонт Из РемонтыОтсутствующиеВДокументахИсточниках Цикл
			ШаблонСообщения = НСтр("ru = 'Для объекта ремонта ""%1"" отсутствует соответствующий ремонт в документе основании ""%2"".'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Ремонт.ОбъектРемонта, Ремонт.ДокументИсточник);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);			
		КонецЦикла;

	КонецЕсли;

	Если НЕ Отказ Тогда
		УстановитьУправляемыеБлокировки();
		торо_ПроцентыВыполнения.СоздатьДокументыПлановыхЗатрат(РемонтыОборудования, РемонтныеРаботы, Ложь);
		ДвиженияПоРегистрам(РежимПроведения, Отказ);
	КонецЕсли;
	
	торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусРемонтовПриПроведении(ЭтотОбъект);
	торо_РаботаСоСтатусамиДокументовСервер.ИзменитьСтатусыДокументовРемонта(Ссылка);
	
	торо_Ремонты.ОбновитьЗаписиНезависимыхРегистровПоРемонтам(ЭтотОбъект, РежимЗаписиДокумента.Проведение);
	
	#Вставка
	//++ Проф-ИТ, #340, Корнилов М.С., 28.11.2023
	Если ДополнительныеСвойства.Свойство("ПервоначальнаяЗагрузка") = Ложь Тогда 
		//++ Проф-ИТ, #222, Башинская А.Ю., 03.08.2023, создание док.Состояние ОР на основании 
		проф_СоздатьСостояниеОбъектовРемонтаНаОсновании();
		//-- Проф-ИТ, #222, Башинская А.Ю., 03.08.2023   
	КонецЕсли;
	//-- Проф-ИТ, #340, Корнилов М.С., 28.11.2023
	
	//++ Проф-ИТ, #66, Башинская А.Ю., 14.09.2023
	Если Не Отказ Тогда
		проф_ЗарегистрироватьИзмененияСметыДляИзмененияСтатусаВЕРП();
		//++ Проф-ИТ, #311, Корнилов М.С., 26.10.2023
		проф_СоздатьВнешнееОснованиеДляРабот();
		//-- Проф-ИТ, #311, Корнилов М.С., 26.10.2023
		//++ Проф-ИТ, #350, Соловьев А.А., 16.11.2023
		проф_ЗаполнитьПричинуОтменыВЗаказеНаВП();
		//-- Проф-ИТ, #350, Соловьев А.А., 16.11.2023
	КонецЕсли;
	//-- Проф-ИТ, #66, Башинская А.Ю., 14.09.2023  
	#КонецВставки 
	
КонецПроцедуры   

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура проф_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	
	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
		МассивВсехРеквизитов,
		МассивРеквизитовОперации,
		МассивНепроверяемыхРеквизитов);
		
	#Вставка
	//++ Проф-ИТ, #326, Соловьев А.А., 01.11.2023
	Если РемонтныеРаботы.Найти(Ложь, "Выполнено") = Неопределено Тогда 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("проф_ЭксплуатацияВозможна"));
	КонецЕсли;
	//-- Проф-ИТ, #326, Соловьев А.А., 01.11.2023
	#КонецВставки
	ФОИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("торо_ИспользоватьХарактеристикиНоменклатуры");
	МассивНепроверяемыхРеквизитов.Добавить("МатериальныеЗатраты.ХарактеристикаНоменклатуры");
	Если ФОИспользоватьХарактеристикиНоменклатуры = Истина Тогда
		ПараметрыПроверки = Новый Структура("СуффиксХарактеристики, ИмяТЧ", "Номенклатуры", "МатериальныеЗатраты");
		НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ, ПараметрыПроверки);
	КонецЕсли;
	
	Если Не Отказ И ОбщегоНазначенияУТ.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, ПроверяемыеРеквизиты) Тогда
		Отказ = Истина;
	КонецЕсли;

	ПроверитьДублиИсполнителей(Отказ);
	
	СписокТЧ = Новый Структура();
	СписокТЧ.Вставить("РемонтныеРаботы", "Ремонтные работы");
	СписокТЧ.Вставить("РемонтыОборудования", "Ремонты оборудования");
	
	ШаблонСообщения = НСтр("ru = 'В табличной части ""%1"" нет строк.'");
	Для каждого текТЧ из СписокТЧ Цикл
		Если ЭтотОбъект[ТекТЧ.Ключ].Количество() = 0 Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекТЧ.Значение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru = 'Для объекта ремонта ""%1"" с видом ремонта ""%2"" отсутствуют строки в дереве ремонтных работ.'");
	Для Каждого СтрокаСРемонтом Из РемонтыОборудования Цикл
		МассивСтрок = РемонтныеРаботы.НайтиСтроки(Новый структура("РемонтыОборудования_ID", СтрокаСРемонтом.ID));
		Если МассивСтрок.Количество() = 0 Тогда			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаСРемонтом.ОбъектРемонта, СтрокаСРемонтом.ВидРемонтныхРабот);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;			
		КонецЕсли;
	КонецЦикла;

	// Проверка заполнения табличных частей.
	ПроверитьЗаполнениеТабличнойЧастиРемонтыОборудования(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиРемонтныеРаботы(РемонтныеРаботы, Отказ);
	ПроверитьЗаполнениеТабличнойЧастиМатериальныеЗатраты(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиПоДокументамОснованиям(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиТрудовыеЗатраты(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиСерийныеЗапчасти(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиИсполнители(Отказ); 
	
	Если Константы.торо_ЗапретитьПересечениеВремениРаботыСотрудниковСОдинаковойКвалификацией.Получить()
		И торо_ОбщегоНазначения.ПроверитьВремяРаботыСотрудников(ЭтотОбъект, "ТрудовыеЗатраты") Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура проф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//++ Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		проф_ОбщегоНазначенияВызовСервера.ПроверитьПризнакПодразделенияОрганизации(ЭтотОбъект["Подразделение"], Отказ);
	КонецЕсли;
	//-- Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Проф-ИТ, #222, Башинская А.Ю., 03.08.2023, создание док.Состояние ОР на основании
Процедура проф_СоздатьСостояниеОбъектовРемонтаНаОсновании()
	
	НайденныйДокумент = проф_НайтиСозданныйРанееДокументСостояниеОР();
	
	Если НайденныйДокумент = Неопределено Тогда
		// Нужно создавать документ
		ДокументСОР = Документы.торо_СостоянияОбъектовРемонта.СоздатьДокумент();
		ДокументСОР.Дата = ТекущаяДатаСеанса();
	Иначе  
		// Обновим уже созданный документ
		ДокументСОР = НайденныйДокумент.ПолучитьОбъект(); 
		ДокументСОР.ОбъектыРемонта.Очистить();
	КонецЕсли;
	
	ДокументСОР.Заполнить(Ссылка);  
	ДокументСОР.ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации; 
	ДокументСОР.Автор = Ссылка.Автор;
	ДокументСОР.Ответственный = Ссылка.Ответственный;	
	ДокументСОР.Записать(РежимЗаписиДокумента.Проведение); 
	
КонецПроцедуры

Функция проф_НайтиСозданныйРанееДокументСостояниеОР()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_СостоянияОбъектовРемонта.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.торо_СостоянияОбъектовРемонта КАК торо_СостоянияОбъектовРемонта
	|ГДЕ
	|	НЕ торо_СостоянияОбъектовРемонта.ПометкаУдаления 
	|	И торо_СостоянияОбъектовРемонта.Проведен
	|	И торо_СостоянияОбъектовРемонта.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат	ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
//-- Проф-ИТ, #222, Башинская А.Ю., 03.08.2023

//++ Проф-ИТ, #66, Башинская А.Ю., 14.09.2023
Процедура проф_ЗарегистрироватьИзмененияСметыДляИзмененияСтатусаВЕРП()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID,
	|	торо_ЗаявкиПоРемонтам.Регистратор КАК Смета
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
	|		ПО торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID = торо_ЗаявкиПоРемонтам.IDРемонта
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка = &Ссылка";	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Заявка = Неопределено;	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Смета) Тогда
			Заявка = ВыборкаДетальныеЗаписи.Смета;
		КонецЕсли;
	КонецЦикла;
	
	//++ Проф-ИТ, #225, Горетовская М.С., 06.09.2023 - Разработать обработку по загрузке исторических данных о фактических затратах на ОР
	Если Заявка = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	//-- Проф-ИТ, #225, Горетовская М.С., 06.09.2023 - Разработать обработку по загрузке исторических данных о фактических затратах на ОР
	
	ЗаявкаОбъект = Заявка.получитьОбъект();  
	ЗаявкаОбъект.ОбменДанными.Загрузка = Истина;
	ИмяПланаОбмена = "ОбменТОИР30ЕРП20";
	Если Заявка.Проведен Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	Иначе
		РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	
	торо_ОбменТОИР30ЕРП20События.ОбменТОиР30ЕРП20_ЗарегистрироватьИзменениеДокументаПередЗаписью(ЗаявкаОбъект,
		Ложь, РежимЗаписи, РежимПроведенияДокумента.Неоперативный);
	Попытка
		ЗаявкаОбъект.Записать();
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
		"Документ.торо_АктОВыполненииЭтапаРабот.проф_ЗарегистрироватьИзмененияСметыДляИзмененияСтатусаВЕРП",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Документы.торо_АктОВыполненииЭтапаРабот,
		Ссылка, 
		ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры 
//-- Проф-ИТ, #66, Башинская А.Ю., 14.09.2023


//++ Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
&ИзменениеИКонтроль("ПодготовитьТаблицуМатериальныхЗатрат")
Функция проф_ПодготовитьТаблицуМатериальныхЗатрат(ТаблицаДвижений)

	ТаблицаМатериальныхЗатрат = Движения.торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Выгрузить();

	Если МатериальныеЗатраты.Количество()=0 Тогда

		Возврат ТаблицаМатериальныхЗатрат;

	КонецЕсли; 

	БуферМЗ = МатериальныеЗатраты.Выгрузить();
	БуферМЗ.Колонки.Добавить("Период");
	Для Каждого СтрокаТЗ Из БуферМЗ Цикл
		КоэффициентЕИ = СтрокаТЗ.ЕдиницаИзмерения.Коэффициент;
		СтрокаТЗ.Количество = СтрокаТЗ.Количество * ?(КоэффициентЕИ = 0, 1, КоэффициентЕИ);

		СтрокаРемонта = РемонтыОборудования.Найти(СтрокаТЗ.РемонтыОборудования_ID);
		Если СтрокаРемонта <> Неопределено Тогда
			СтрокаТЗ.Период = СтрокаРемонта.ДатаОкончания;
		КонецЕсли;
	КонецЦикла;

	БуферМЗ.Свернуть("ID, РемонтыОборудования_ID, Номенклатура, ХарактеристикаНоменклатуры,Период", "Количество");
#Вставка //++ Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
	ТаблицаМатериальныхЗатрат.Колонки.Добавить("Выполнено",Новый ОписаниеТипов("Булево"));
#КонецВставки //-- Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
	
	Для Каждого СтрокаТЗ Из БуферМЗ Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ID) Тогда
			Продолжить;	
		КонецЕсли;

		НайденнаяСтрокаТЗ = РемонтныеРаботы.Найти(СтрокаТЗ.ID, "ID");
		Если Не НайденнаяСтрокаТЗ = Неопределено Тогда
			НовСтрокаТЗ = ТаблицаМатериальныхЗатрат.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаТЗ, СтрокаТЗ);
			НовСтрокаТЗ.РемонтнаяРабота = НайденнаяСтрокаТЗ.РемонтнаяРабота;
#Вставка //++ Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
			НовСтрокаТЗ.Выполнено = НайденнаяСтрокаТЗ.Выполнено;
#КонецВставки //-- Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
		КонецЕсли; 

	КонецЦикла; 

#Удаление
	ТаблицаМатериальныхЗатрат.Свернуть("ID, РемонтыОборудования_ID, Номенклатура, ХарактеристикаНоменклатуры,Период, РемонтнаяРабота", "Количество");
#КонецУдаления
#Вставка //++ Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
	ТаблицаМатериальныхЗатрат.Свернуть("ID, РемонтыОборудования_ID, Номенклатура, ХарактеристикаНоменклатуры,Период, РемонтнаяРабота, Выполнено", "Количество");
#КонецВставки //-- Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"

	Возврат ТаблицаМатериальныхЗатрат;

КонецФункции

&ИзменениеИКонтроль("ДвиженияПоРегистру_торо_ФактическиеМатериальныеЗатратыРемонтныхРабот")
Процедура проф_ДвиженияПоРегистру_торо_ФактическиеМатериальныеЗатратыРемонтныхРабот(РежимПроведения, ТаблицаМатериальныхЗатрат, Отказ)

	Движения.торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Записывать = Истина;
#Вставка //++ Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
	Движения.проф_МатериальныеЗатратыНаНевыполненныеРемонтныеРаботы.Записывать = Истина;
#КонецВставки //-- Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
	Для Каждого ЗаписьМатериальныеЗатраты ИЗ ТаблицаМатериальныхЗатрат Цикл
#Вставка //++ Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
		Если ЗаписьМатериальныеЗатраты.Выполнено тогда
#КонецВставки //-- Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
		Движение = Движения.торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Добавить();
		Движение.ID = ЗаписьМатериальныеЗатраты.ID;
		Движение.РемонтыОборудования_ID = ЗаписьМатериальныеЗатраты.РемонтыОборудования_ID;
		Движение.Количество = ЗаписьМатериальныеЗатраты.Количество;
		Движение.Номенклатура = ЗаписьМатериальныеЗатраты.Номенклатура;
		Движение.Период = ЗаписьМатериальныеЗатраты.Период;
		Движение.РемонтнаяРабота = ЗаписьМатериальныеЗатраты.РемонтнаяРабота;
		Движение.ХарактеристикаНоменклатуры = ЗаписьМатериальныеЗатраты.ХарактеристикаНоменклатуры;
#Вставка //++ Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
		иначе
			Движение = Движения.проф_МатериальныеЗатратыНаНевыполненныеРемонтныеРаботы.Добавить();
			Движение.ID = ЗаписьМатериальныеЗатраты.ID;
			Движение.РемонтыОборудования_ID = ЗаписьМатериальныеЗатраты.РемонтыОборудования_ID;
			Движение.Количество = ЗаписьМатериальныеЗатраты.Количество;
			Движение.Номенклатура = ЗаписьМатериальныеЗатраты.Номенклатура;
			Движение.Период = ЗаписьМатериальныеЗатраты.Период;
			Движение.РемонтнаяРабота = ЗаписьМатериальныеЗатраты.РемонтнаяРабота;
			Движение.ХарактеристикаНоменклатуры = ЗаписьМатериальныеЗатраты.ХарактеристикаНоменклатуры;
		КонецЕсли;
#КонецВставки //-- Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("ДвиженияПоРегистру_торо_ВыполненныеРемонтныеРаботы")
Процедура проф_ДвиженияПоРегистру_торо_ВыполненныеРемонтныеРаботы(РежимПроведения, ТабРемРаб, Отказ)

	Движения.торо_ВыполненныеРемонтныеРаботы.Записывать = Истина;
#Вставка //++ Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
	Движения.проф_НевыполненныеРемонтныеРаботы.Записывать = Истина;
#КонецВставки //-- Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"

	Если ЗавершитьРемонтныеРаботы Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремТаб.РемонтыОборудования_ID КАК IDРемонта,
		|	ВремТаб.ID КАК IDОперации,
		|	ВремТаб.Родитель_ID
		|ПОМЕСТИТЬ Таб
		|ИЗ 
		|	&Таб КАК ВремТаб
		|
		|;
		|
		|ВЫБРАТЬ
		|	торо_ВыполненныеРемонтныеРаботыСрезПоследних.IDРемонта,
		|	торо_ВыполненныеРемонтныеРаботыСрезПоследних.IDОперации,
		|	торо_ВыполненныеРемонтныеРаботыСрезПоследних.Родитель_ID
		|ИЗ
		|	РегистрСведений.торо_ВыполненныеРемонтныеРаботы.СрезПоследних(, (IDОперации, IDРемонта, Родитель_ID) В (ВЫБРАТЬ Таб.IDОперации, Таб.IDРемонта, Таб.Родитель_ID ИЗ Таб КАК Таб)) КАК торо_ВыполненныеРемонтныеРаботыСрезПоследних";

		Запрос.УстановитьПараметр("Таб", ТабРемРаб);

		РезультатЗапроса = Запрос.Выполнить();

		ТабЗакрытыхРабот = РезультатЗапроса.Выгрузить();

	КонецЕсли;

	Для каждого СтрТаб Из ТабРемРаб Цикл

		ДелатьДвижение = Ложь;
		Если ЗавершитьРемонтныеРаботы Тогда
			МассивСтрок = ТабЗакрытыхРабот.НайтиСтроки(Новый Структура("IDОперации, IDРемонта, Родитель_ID", СтрТаб.ID, СтрТаб.РемонтыОборудования_ID, СтрТаб.Родитель_ID));
			Если МассивСтрок.Количество() Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		Если ЗавершитьРемонтныеРаботы Тогда
			ПроцентВыполнения = (100 - (СтрТаб.ПроцентОперацийОстатокЗаплРем - СтрТаб.ПроцентВыполненияРабот)) * СтрТаб.Количество;
			ДелатьДвижение = Истина;
		Иначе
			Если ФОИспользоватьУсложненнуюСхемуЗакрытияНарядов Тогда
				Если СтрТаб.ПроцентВыполненияРабот = 100 Тогда
					ПроцентВыполнения = 100;
					ДелатьДвижение = Истина;
				КонецЕсли;
			Иначе
				Если СтрТаб.Выполнено Тогда
					ПроцентВыполнения = 100;
					ДелатьДвижение = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если ДелатьДвижение Тогда 
#Вставка //++ Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
			Если СтрТаб.Выполнено тогда
#КонецВставки //-- Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
			Движение = Движения.торо_ВыполненныеРемонтныеРаботы.Добавить();
			Движение.Период = Дата;
			Движение.IDОперации = СтрТаб.ID;
			Движение.IDРемонта = СтрТаб.РемонтыОборудования_ID;
			Движение.Родитель_ID = СтрТаб.Родитель_ID;
			Движение.ПроцентВыполнения = ПроцентВыполнения;
#Вставка //++ Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
			Иначе
				Движение = Движения.проф_НевыполненныеРемонтныеРаботы.Добавить();
				Движение.Период = Дата;
				Движение.IDОперации = СтрТаб.ID;
				Движение.IDРемонта = СтрТаб.РемонтыОборудования_ID;
				Движение.Родитель_ID = СтрТаб.Родитель_ID;
				Движение.ПроцентВыполнения = ПроцентВыполнения;
			КонецЕсли;
#КонецВставки //-- Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

//-- Проф-ИТ, #289, Горетовская М.С., 04.10.2023 - Наполнение РС "Невыполненные ремонтные работы"

//++ Проф-ИТ, #311, Корнилов М.С., 26.10.2023
Процедура проф_СоздатьВнешнееОснованиеДляРабот()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ВнешнееОснованиеДляРабот.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.торо_ВнешнееОснованиеДляРабот КАК торо_ВнешнееОснованиеДляРабот
	|ГДЕ
	|	торо_ВнешнееОснованиеДляРабот.ДокументОснование = &ДокументОснование
	|	И торо_ВнешнееОснованиеДляРабот.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		ВнешнееОснованиеОбъект = Документы.торо_ВнешнееОснованиеДляРабот.СоздатьДокумент();
		ВнешнееОснованиеОбъект.Заполнить(Ссылка);
		Если ВнешнееОснованиеОбъект.РемонтныеРаботы.Количество() > 0 Тогда 
			ВнешнееОснованиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//-- Проф-ИТ, #311, Корнилов М.С., 26.10.2023

//++ Проф-ИТ, #329, Соловьев А.А., 08.11.2023
&После("ДвиженияПоРегистрам")
Процедура проф_ДвиженияПоРегистрам(РежимПроведения, Отказ)
	
	Если Не Отказ Тогда
		Документы.торо_АктОВыполненииЭтапаРабот.проф_ДвиженияПоРегистру_проф_СоответствиеАктовИВнутреннегоПотребления(Ссылка);
		проф_ДвиженияПоРегистру_проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт(РежимПроведения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура проф_ДвиженияПоРегистру_проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт(РежимПроведения, Отказ)
	
	Движения.проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Дата КАК Период,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка КАК АктОВыполненииЭтапаРабот,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ХарактеристикаНоменклатуры КАК Характеристика,
	|	СУММА(торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Количество) КАК Количество
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|		ПО торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка
	|			И торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.РемонтыОборудования_ID = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ХарактеристикаНоменклатуры";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;
	
КонецПроцедуры
//-- Проф-ИТ, #329, Соловьев А.А., 08.11.2023

//++ Проф-ИТ, #350, Соловьев А.А., 16.11.2023
Процедура проф_ЗаполнитьПричинуОтменыВЗаказеНаВП()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ИнтеграцияДокументов.ДокументЕРП КАК ЗаказНаВнутреннееПотребление
	|ПОМЕСТИТЬ ЗаказыНаВП
	|ИЗ
	|	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	|ГДЕ
	|	торо_ИнтеграцияДокументов.ID В(&СписокID)
	|	И торо_ИнтеграцияДокументов.ДокументЕРП.Проведен
	|	И ТИПЗНАЧЕНИЯ(торо_ИнтеграцияДокументов.ДокументЕРП) = ТИП(Документ.ЗаказНаВнутреннееПотребление)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаВнутреннееПотреблениеТовары.Ссылка КАК Ссылка,
	|	ЗаказНаВнутреннееПотреблениеТовары.КодСтроки КАК КодСтроки,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.проф_Отменено КАК Отменено
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление.проф_ТоварыИсточника КАК ТоварыИсточника
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление.Товары КАК ЗаказНаВнутреннееПотреблениеТовары
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаказыНаВП КАК ЗаказыНаВП
	|				ПО ЗаказНаВнутреннееПотреблениеТовары.Ссылка = ЗаказыНаВП.ЗаказНаВнутреннееПотребление
	|			ПО ТоварыИсточника.КодСтроки = ЗаказНаВнутреннееПотреблениеТовары.КодСтроки
	|		ПО торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ID = ТоварыИсточника.ID
	|			И торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.РемонтыОборудования_ID = ТоварыИсточника.РемонтыОборудования_ID
	|			И торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура = ТоварыИсточника.Номенклатура
	|			И торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ХарактеристикаНоменклатуры = ТоварыИсточника.Характеристика
	|			И торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения = ТоварыИсточника.Упаковка
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка = &Ссылка
	|	И торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.проф_Отменено <> ЗаказНаВнутреннееПотреблениеТовары.Отменено
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("СписокID", РемонтыОборудования.ВыгрузитьКолонку("ID"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока ВыборкаСсылка.Следующий() Цикл
			
			ДокументЗВПОбъект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
			
			Выборка = ВыборкаСсылка.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаТовары = ДокументЗВПОбъект.Товары.Найти(Выборка.КодСтроки, "КодСтроки");
				Если СтрокаТовары = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаТовары.Отменено = Выборка.Отменено;
				Если СтрокаТовары.Отменено Тогда 
					СтрокаТовары.проф_ПричинаОтмены = Ссылка;
				Иначе
					СтрокаТовары.проф_ПричинаОтмены = Документы.торо_АктОВыполненииЭтапаРабот.ПустаяСсылка();
				КонецЕсли;
				
			КонецЦикла;
			
			ДокументЗВПОбъект.БезусловнаяЗапись = Истина;
			ДокументЗВПОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось внести изменения в документ Заказ на внутреннее потребление по причине: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры
//-- Проф-ИТ, #350, Соловьев А.А., 16.11.2023

#КонецОбласти
